IDEA Open Model
LineSupportSegment.Segment Property
Compatible with IDEA StatiCa 20.1
 Reference to geometrical segment3D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public ReferenceElement Segment { get; set; }
Public Property Segment As ReferenceElement
	Get
	Set
Property Value
Type: ReferenceElement
See Also
Reference
LineSupportSegment Class
IdeaRS.OpenModel.Model Namespace